## Time Methods

## Python Datetime Review

Basic Python outside of Pandas contains a datetime library:

In [2]:
import pandas as pd
import numpy as np
from datetime import datetime

In [ ]:
datetime.

In [ ]:
# pd.to_datetime()  # Docstringi incele!!!!

In [4]:
pd.to_datetime()

In [6]:
df = pd.DataFrame({'year': [2015, 2016],
                    'month': [2, 3],
                    'day': [4, 5]})

df

   year  month  day
0  2015      2    4
1  2016      3    5

In [7]:
pd.to_datetime(df)  # df'teki yıl, ay, gün sütunlarını birleştirerek tek sütunluk bit datetime obj. döndürdü.

0   2015-02-04
1   2016-03-05
dtype: datetime64[ns]

In [8]:
pd.to_datetime(1223847452786)  # unit default değeri ns olduğu için girilen ns değerini direk tarihe çevirir.

Timestamp('1970-01-01 00:20:23.847452786')

In [19]:
myyear = 2017
mymonth = 5
myday = 1
myhour = 2
mymin = 30
mysec = 15

In [20]:
mydate = datetime(myyear, mymonth, myday)
mydate

datetime.datetime(2017, 5, 1, 0, 0)

In [21]:
type(mydate)

datetime.datetime

In [22]:
mydate_full = datetime(myyear,mymonth,myhour, myday,mymin,mysec)

mydate_full

datetime.datetime(2017, 5, 2, 1, 30, 15)

In [23]:
mydate.day

1

In [24]:
mydate.year

2017

In [25]:
mydate.month

5

In [26]:
mydate_full.date()

datetime.date(2017, 5, 2)

In [27]:
mydate_full.time()

datetime.time(1, 30, 15)

## Converting to datetime

In [28]:
myser = pd.Series(["Nov 3, 1990", "2000-01-01", None])
myser

0    Nov 3, 1990
1     2000-01-01
2           None
dtype: object

In [29]:
timeser = pd.to_datetime(myser)
timeser

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [31]:
timeser[0].year

1990

In [32]:
obvi_euro_date = "31-12-2000"

In [33]:
pd.to_datetime(obvi_euro_date)  # burada gün 31 old. için gün-ay-yıl sıralaması olduğu açıktır.

Timestamp('2000-12-31 00:00:00')

In [34]:
# 10th of Dec OR 12th of October?
# We may need to tell pandas

euro_date = "10-12-2000"  # Ancak burada str değişkenimi datetime türüne değiştirince

In [36]:
pd.to_datetime(euro_date)  # gün ile ay bilgisinin yer değiştirdiğini görebiliriz.

Timestamp('2000-10-12 00:00:00')

In [37]:
# yukarıdaki değişikliği engellemek için dayfirst parametresini True olarak kullanmalıyız.

pd.to_datetime(euro_date, dayfirst=True)

Timestamp('2000-12-10 00:00:00')

## Custom Time String Formatting

In [38]:
style_date = "12--Dec--2000"

In [39]:
pd.to_datetime(style_date, format="%d--%b--%Y")

Timestamp('2000-12-12 00:00:00')

In [44]:
style_date = "12-*Dec-*2000"

In [45]:
pd.to_datetime(style_date, format="%d-*%b-*%Y")

Timestamp('2000-12-12 00:00:00')

In [47]:
style_date = "12---Dec---2000"

In [48]:
pd.to_datetime(style_date, format="%d---%b---%Y")

Timestamp('2000-12-12 00:00:00')

In [49]:
strange_date = "12th of Dec 2000"

In [50]:
pd.to_datetime(strange_date)

Timestamp('2000-12-12 00:00:00')

In [52]:
another_date = " 12   12   2000   "
pd.to_datetime(another_date)

Timestamp('2000-12-12 00:00:00')

In [54]:
df = pd.read_csv("../DA_TimeSensitive_Interview_Excersizes/Excersize_1/currency_rates_082020_EUR.csv")

In [55]:
df.head()

  currency      date  rate
0      EUR  8/1/2020   1.0
1      EUR  8/2/2020   1.0
2      EUR  8/3/2020   1.0
3      EUR  8/4/2020   1.0
4      EUR  8/5/2020   1.0

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 220 entries, 0 to 219
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   currency  220 non-null    object
 1   date      220 non-null    object
 2   rate      220 non-null    float64
dtypes: float64(1), object(2)
memory usage: 5.3+ KB

In [57]:
df.iloc[0]["date"]

'8/1/2020'

In [58]:
type(df.iloc[0]["date"])

str

In [60]:
df["date"] = pd.to_datetime(df["date"])
df["date"].head()

0   2020-08-01
1   2020-08-02
2   2020-08-03
3   2020-08-04
4   2020-08-05
Name: date, dtype: datetime64[ns]

In [63]:
type(df["date"])

pandas.core.series.Series

In [65]:
type(df["date"].iloc[0])

pandas._libs.tslibs.timestamps.Timestamp

In [66]:
df["date"].dt.date  # serilerde date bilgilerini çekebilmek için

0      2020-08-01
1      2020-08-02
2      2020-08-03
3      2020-08-04
4      2020-08-05
          ...
215    2020-08-06
216    2020-08-07
217    2020-08-08
218    2020-08-09
219    2020-08-10
Name: date, Length: 220, dtype: object

In [67]:
df["date"].dt.time  # serilerde time bilgilerini çekebilmek için

0      00:00:00
1      00:00:00
2      00:00:00
3      00:00:00
4      00:00:00
         ...
215    00:00:00
216    00:00:00
217    00:00:00
218    00:00:00
219    00:00:00
Name: date, Length: 220, dtype: object

In [70]:
df[df["currency"] == "GBP"][["date","rate"]].iloc[9]

date    2020-08-10 00:00:00
rate                0.89775
Name: 19, dtype: object

In [71]:
df[df["currency"] == "GBP"][["date","rate"]].iloc[9] - df[df["currency"] == "GBP"][["date","rate"]].iloc[4]

date    5 days 00:00:00
rate           -0.00675
dtype: object

In [72]:
df = df.set_index("date")

In [74]:
df

           currency    rate
date
2020-08-01      EUR  1.0000
2020-08-02      EUR  1.0000
2020-08-03      EUR  1.0000
2020-08-04      EUR  1.0000
2020-08-05      EUR  1.0000
...             ...     ...
2020-08-06      BRL  6.3324
2020-08-07      BRL  6.4111
2020-08-08      BRL  6.4111
2020-08-09      BRL  6.4111
2020-08-10      BRL  6.4351

[220 rows x 2 columns]

In [83]:
sales=pd.read_csv("RetailSales_BeerWineLiquor.csv", parse_dates=[0])
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [84]:
sales = sales.set_index("DATE")

In [85]:
sales.resample(rule="A").mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [86]:
sales.resample(rule="AS").mean()

            MRTSSM4453USN
DATE
1992-01-01    1807.250000
1993-01-01    1794.833333
1994-01-01    1841.750000
1995-01-01    1833.916667
1996-01-01    1929.750000
1997-01-01    2006.750000
1998-01-01    2115.166667
1999-01-01    2206.333333
2000-01-01    2375.583333
2001-01-01    2468.416667
2002-01-01    2491.166667
2003-01-01    2539.083333
2004-01-01    2682.416667
2005-01-01    2797.250000
2006-01-01    3001.333333
2007-01-01    3177.333333
2008-01-01    3292.000000
2009-01-01    3353.750000
2010-01-01    3450.083333
2011-01-01    3532.666667
2012-01-01    3697.083333
2013-01-01    3839.666667
2014-01-01    4023.833333
2015-01-01    4212.500000
2016-01-01    4434.416667
2017-01-01    4602.666667
2018-01-01    4830.666667
2019-01-01    4972.750000
2020-01-01    4922.500000

In [91]:
df = df.reset_index()

In [92]:
df

          date currency    rate
0   2020-08-01      EUR  1.0000
1   2020-08-02      EUR  1.0000
2   2020-08-03      EUR  1.0000
3   2020-08-04      EUR  1.0000
4   2020-08-05      EUR  1.0000
..         ...      ...     ...
215 2020-08-06      BRL  6.3324
216 2020-08-07      BRL  6.4111
217 2020-08-08      BRL  6.4111
218 2020-08-09      BRL  6.4111
219 2020-08-10      BRL  6.4351

[220 rows x 3 columns]

In [103]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 220 entries, 0 to 219
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      220 non-null    datetime64[ns]
 1   currency  220 non-null    object
 2   rate      220 non-null    float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 5.3+ KB

In [96]:
df[df["date"].between("1994-01-01", "2018-01-01", inclusive="both")]

Empty DataFrame
Columns: [date, currency, rate]
Index: []

In [105]:
sales.between_time("01:00", "05:00")

Empty DataFrame
Columns: [MRTSSM4453USN]
Index: []

In [107]:
i = pd.date_range('2018-04-09', periods=4, freq='1D20min')

# 1D20mim:1 gün 20 dk aralıklarla belirtilen başlangıç değerinden itibaren datetime index oluşturmak için

i

DatetimeIndex(['2018-04-09 00:00:00', '2018-04-10 00:20:00',
               '2018-04-11 00:40:00', '2018-04-12 01:00:00'],
              dtype='datetime64[ns]', freq='1460T')

In [108]:
ts = pd.DataFrame({'A': [1, 2, 3, 4]}, index=i)

ts

                     A
2018-04-09 00:00:00  1
2018-04-10 00:20:00  2
2018-04-11 00:40:00  3
2018-04-12 01:00:00  4

In [110]:
ts.between_time("0:15","0:50")  # başlangıç ve bitiş saatleri arasında kalanlar

                     A
2018-04-10 00:20:00  2
2018-04-11 00:40:00  3

In [111]:
ts.between_time("0:50","0:15")  # son saati önce yazarsanız bu iki saat/dk arasındakilerin dışında kalanlar

                     A
2018-04-09 00:00:00  1
2018-04-12 01:00:00  4

In [120]:
i = pd.date_range('2018-04-09', periods=12, freq='30D')  # 30 günlük frekans

In [121]:
i

DatetimeIndex(['2018-04-09', '2018-05-09', '2018-06-08', '2018-07-08',
               '2018-08-07', '2018-09-06', '2018-10-06', '2018-11-05',
               '2018-12-05', '2019-01-04', '2019-02-03', '2019-03-05'],
              dtype='datetime64[ns]', freq='30D')

In [122]:
i = pd.date_range('2018-04-09', periods=12, freq='M')  # aylık frekans
i

DatetimeIndex(['2018-04-30', '2018-05-31', '2018-06-30', '2018-07-31',
               '2018-08-31', '2018-09-30', '2018-10-31', '2018-11-30',
               '2018-12-31', '2019-01-31', '2019-02-28', '2019-03-31'],
              dtype='datetime64[ns]', freq='M')

In [124]:
i = pd.date_range('2018-04-09', periods=12, freq='B')  # iş günlerine göre frekansla index oluşturma
i

DatetimeIndex(['2018-04-09', '2018-04-10', '2018-04-11', '2018-04-12',
               '2018-04-13', '2018-04-16', '2018-04-17', '2018-04-18',
               '2018-04-19', '2018-04-20', '2018-04-23', '2018-04-24'],
              dtype='datetime64[ns]', freq='B')